app/Controllers/AuthController.php

INSERT INTO `users` (`name`, `phone`, `email`) VALUES ('Dinesh', '8120876545', 'dinesh@gmail.com')
---
    public function register()
    {
        $rules = [
            'name'  => 'required',
            'phone' => 'required|exact_length[10]|is_unique[users.phone]',
            'email' => 'required|valid_email|is_unique[users.email]'
        ];

        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        if (!$this->validate($rules)) {
            return $this->respond([
                'status'  => false,
                'message' => $this->validator->getErrors()
            ], 400);
        }

        $userModel = new UserModel();
        $userModel->insert([
            'name'  => $input['name'],
            'phone' => $input['phone'],
            'email' => $input['email']
        ]);

DELETE FROM `otps`
WHERE `phone` = '8120876545'
INSERT INTO `otps` (`phone`, `otp`) VALUES ('8120876545', 1234)
---
    private function sendOtp($phone)
    {
        //$otp = rand(1000, 9999); // Generate 4-digit OTP
        $otp = 1234; // Static OTP for testing (replace with the above line in production)

        $otpModel = new OtpModel();
        $otpModel->where('phone', $phone)->delete(); // Remove old OTP
        $otpModel->insert(['phone' => $phone, 'otp' => $otp]);

SELECT *
FROM `users`
WHERE `phone` = '8120876545'
 LIMIT 1
---
    public function login()
    {
        $rules = ['phone' => 'required|exact_length[10]'];
        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        if (!$this->validate($rules)) {
            return $this->respond([
                'status'  => false,
                'message' => $this->validator->getErrors()
            ], 400);
        }

        if (!isset($input['phone'])) {
            return $this->respond([
                'status'  => false,
                'message' => 'Phone number is required.'
            ], 400);
        }

        $userModel = new UserModel();
        $user = $userModel->where('phone', $input['phone'])->first();

SELECT *
FROM `otps`
WHERE `phone` = '8120876545'
AND `otp` = 1234
 LIMIT 1
---
    public function verifyOtp()
    {
        $rules = [
            'phone' => 'required|exact_length[10]',
            'otp'   => 'required|exact_length[4]'
        ];

        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        if (!$this->validate($rules)) {
            return $this->respond([
                'status'  => false,
                'message' => $this->validator->getErrors()
            ], 400);
        }

        if (!isset($input['phone']) || !isset($input['otp'])) {
            return $this->respond([
                'status'  => false,
                'message' => 'Phone and OTP are required.'
            ], 400);
        }

        $otpModel = new OtpModel();
        $otpData = $otpModel->where([
            'phone' => $input['phone'],
            'otp'   => $input['otp']
        ])->first();

DELETE FROM `otps`
WHERE `phone` = '8120876545'
---
        }

        // OTP is valid - delete from database
        $otpModel->where('phone', $input['phone'])->delete();